<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"773b0630cc94b02c74978be4371091c63b79319f4cd2e6dca57dc87d3d938746","plan_job_ref":"Job Run Terraform plan in staging #147 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12634754355","plan_out_hash":"4098ea90cf06362b87eb8b137cfb276983016311608e7609730c04732175cc8f","plan_hash":"ef44a0c4e7fd4b20c82fb628e3aa7398e5d02dc8820dfa6045c94bd62bb29945","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "continuous_monitoring-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "15U7Ftu4+L+L2/jOLM8p6eOLK76qnoaux9mTll3cLR0=" -> "ypavhHV5j/dU7F1Xc0UPWlTnk060Oih69LrqZJ05Usg="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-06T14:53:40Z" -> (known after apply)
#        (13 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #147](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12634754355)